CSI API ETABS v1

# cSapModelAnalyze Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cAnalyze Analyze { get; }

    ReadOnly Property Analyze As cAnalyze
    	Get

    Dim instance As cSapModel
    Dim value As cAnalyze

    value = instance.Analyze

    property cAnalyze^ Analyze {
    	cAnalyze^ get ();
    }

    abstract Analyze : cAnalyze with get

#### Property Value

Type: cAnalyze

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com